УТ_для_edt.РасширениеСмарт/src/DataProcessors/ЖурналДокументовЗакупки/ЖурналДокументовЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="be6c7627-3a81-434a-bccf-007a451c8959">
  <name>ЖурналДокументовЗакупки</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаПеремещение/ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартКонечнаяДатаРезерва</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартДатаПродленияРезервов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартРезервЗаканчивается</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="025cec6b-a37b-4836-802d-b862a2c24680">
    <name>смартВидТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb1bda59-7ed7-46ee-9737-0e55e9b9f6e6">
    <name>смартНомерМашины</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2b9ec282-ad92-44cb-b072-47a36f857325">
    <name>смартНомерПрицепа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b1471b7a-c73b-41fd-afa0-58788430b04b">
    <name>смартФИОВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="33b186f2-2628-48f3-a24e-adfce58bd35d">
    <name>смартНомерСерияПаспортВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3e9aa296-d524-418d-84ab-e9bea83d77eb">
    <name>смартДатаВыдачиПаспортаВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2f61b178-446c-49e4-b3cd-cf9f1c061abf">
    <name>смартЖелаемаяДатаОтгрузкиАдмирал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="671c355b-5223-4837-980b-5f9cd7f8cc7d">
    <name>смартЖелаемоеВремяОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fbce0c46-a4a3-49a3-aca2-e423debd297a">
    <name>смартФИОВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e99f34bd-4d77-4c27-a9bd-de06fcacc876">
    <name>смартНомерСерияПаспортВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7ac5896-d91d-4ee4-93dc-84fb50a8fe9f">
    <name>смартДатаВыдачиПаспортаВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НачалоОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОкончаниеПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/ЖурналДокументовЗакупки/Forms/СписокДокументов/Module.bsl
#Область ДоработкиСмарт

// Смарт Фролов+ Доп. расходы внесены
&НаКлиенте
Процедура смартДопРасходыВнесены(Команда)
	смартДопРасходыВнесеныСервер(Элементы.СписокДокументыЗакупки.ВыделенныеСтроки);
	Элементы.СписокДокументыЗакупки.Обновить();
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура смартДопРасходыВнесеныСервер(Знач МассивДокументов)
	Ответственный=Пользователи.ТекущийПользователь();
	Для Каждого Док Из МассивДокументов Цикл
		Если ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда 
			смартСервер.ИзменитьДополнительноеСвойство(Док.Ссылка, "смартОтветственныйЗаДопРасходы", Ответственный);
			смартСервер.ИзменитьДополнительноеСвойство(Док.Ссылка, "смартДопРасходыВнесены", Истина);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры
// Фролов-

//++Смарт:Белоусова 522 17.05.2021
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НоваяКоманда = Команды.Добавить("КомандаСоздатьЗаказНаПеремещение");
	НоваяКоманда.Действие = "СоздатьЗаказНаПеремещение";//Имя процедуры
	НоваяКоманда.Заголовок = "Заказ на перемещение";
	
	НовыйЭлемент = Элементы.Добавить("ЭлементСоздатьЗаказНаПеремещение",
	                                 Тип("КнопкаФормы"),
									этаФорма.Элементы.СписокДокументыЗакупки.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "КомандаСоздатьЗаказНаПеремещение";
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;

КонецПроцедуры
&НаКлиенте
Процедура СоздатьЗаказНаПеремещение(команда)
	//сообщить("1");
	выделенныестроки = элементы.СписокДокументыЗакупки.ВыделенныеСтроки;
	если выделенныестроки.Количество()>0 тогда 
		Форма = ПолучитьФорму("Документ.ЗаказНаПеремещение.ФормаОбъекта");
		ДанныеФормы = Форма.Объект;
		пр = ЗаполнитьДокумент(ДанныеФормы,выделенныестроки);
		если   пр  тогда
			КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
			Форма.Открыть();
		КонецЕсли;
	иначе
		сообщить("Не выбрано ни одного документа!");
	КонецЕсли;
КонецПроцедуры


&НаСервере
функция ЗаполнитьДокумент(ДанныеФормы,выделенныестроки)
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ЗаказНаПеремещение"));
	
	Док.Дата = ТекущаяДата();
//	док.партнер = выделенныестроки[0].партнер;
	//док.контрагент = выделенныестроки[0].контрагент;
	док.организация = выделенныестроки[0].организация;
	док.подразделение = выделенныестроки[0].подразделение;
	док.СкладОтправитель = выделенныестроки[0].ссылка.Склад;
	ошибки = новый СписокЗначений;
	для каждого эл  из   выделенныестроки цикл
		если  ТипЗнч(эл.ссылка)<>тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда
			ошибки.Добавить(эл.ссылка);
		иначе
			для каждого эл2 из эл.ссылка.товары цикл
				новстр = док.товары.добавить();
				новстр.номенклатура = эл2.номенклатура;
				новстр.количество = эл2.количество;
				новстр.количествоупаковок = эл2.количествоупаковок;
				новстр.упаковка = эл2.упаковка;
				новстр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;

			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	если ошибки.Количество()>0 тогда
		сообщить("В выбранном списке документов присутсвуют не только документы ПриобретениеТоваровУслуг:");
		для каждого эл из ошибки цикл
			сообщить(эл);
		КонецЦикла;
		сообщить("Выберите документы заново!");
	
		ЗначениеВДанныеФормы(Док,ДанныеФормы);	
		возврат Ложь;
	КонецЕсли;
	ошибки2 = новый СписокЗначений;
	склад = выделенныестроки[0].ссылка.Склад;
	для каждого эл  из   выделенныестроки цикл
		если склад<>эл.ссылка.Склад тогда
	    	ошибки2.Добавить(эл.ссылка);
		КонецЕсли;
	КонецЦикла;
	если ошибки2.Количество()>0 тогда
		сообщить("Выбраны документы с разными складами!");
		сообщить("Выберите документы заново!");
	
		ЗначениеВДанныеФормы(Док,ДанныеФормы);	
		возврат Ложь;
	КонецЕсли;
	ЗначениеВДанныеФормы(Док,ДанныеФормы);
	возврат истина;

КонецФункции
// Фролов-

#КонецОбласти
